

export default function Footer() {
    return (
        <footer>

            <div class="footerBox">
                <img src="/assets/footerLogo.png" alt="킹버스 로고" />

                <div class="companyInfor">
                    <div class="companyInforCell">
                        <div class="companyInforData">대표: 김형주</div>
                        <div class="companyInforData companyInforDataLast">사업자등록번호 : 287-49-00474</div>
                    </div>
                    <div class="companyInforCell">
                        <div class="companyInforData">Tel. 1522-9821 </div>
                        <div class="companyInforData companyInforDataLast">E-mail : kingbus7111@gmail.com</div>
                    </div>
                    <div class="companyInforData">주소: 경기 수원시 매송고색로 804번길 24, 1층</div>
                </div>
            </div>


            <div class="other">

                <div class="questionAndSns">
                    <div>문의하기</div>
                    <div>
                        <a href="https://www.youtube.com/channel/UC0JnvNeE0SQtkmY7dp68fbg" target="_blank">
                            <i class="fab fa-youtube footerSnsIcorn"></i>
                        </a>
                        <a href="https://www.instagram.com/king__bus/" target="_blank">
                            <i class="fab fa-instagram footerSnsIcorn"></i>
                        </a>
                        <a href="https://blog.naver.com/kingbus7111" target="_blank">
                            <svg version="1.0" xmlns="http://www.w3.org/2000/svg" width="3rem" height="2.8rem" margin-left="1rem"
                                margin-right="1rem" viewBox="0 0 840.000000 770.000000" preserveAspectRatio="xMidYMid meet"
                                class="footerSnsIcorn">
                                <g transform="translate(0.000000,770.000000) scale(0.100000,-0.100000)" fill="#b9b9b9" stroke="none">
                                    <path d="M1235 7688 c-206 -23 -438 -109 -620 -230 -148 -98 -320 -281 -419
                    -446 -51 -84 -110 -224 -141 -331 -56 -193 -55 -148 -55 -2176 0 -1210 4
                    -1902 10 -1960 37 -324 183 -619 417 -846 209 -203 425 -313 748 -381 32 -7
                    429 -13 1114 -17 l1064 -6 419 -640 c230 -352 423 -640 428 -640 5 0 198 288
                    428 640 l419 640 1064 6 c682 4 1082 10 1114 17 334 70 566 192 776 409 217
                    223 344 485 384 790 22 165 22 3801 1 3963 -44 326 -185 603 -427 835 -218
                    209 -503 341 -811 374 -123 14 -5794 13 -5913 -1z m543 -2276 l-3 -409 49 40
                    c28 21 77 52 110 69 145 73 252 91 386 64 234 -48 395 -214 467 -484 24 -88
                    27 -114 27 -292 1 -235 -15 -316 -96 -480 -44 -89 -65 -118 -138 -191 -98 -99
                    -186 -149 -310 -175 -168 -35 -342 18 -489 152 -23 20 -44 34 -48 31 -3 -4
                    -13 -39 -22 -79 l-17 -73 -162 -3 -162 -2 0 1113 c0 613 3 1117 7 1120 3 4 96
                    7 206 7 l199 0 -4 -408z m1812 -543 c5 -905 6 -948 24 -967 12 -14 33 -22 64
                    -24 l47 -3 22 -130 c31 -182 32 -171 -29 -186 -29 -8 -100 -13 -158 -13 -86 0
                    -116 4 -164 23 -101 40 -168 126 -205 260 -12 48 -15 198 -18 1010 -2 524 -2
                    960 1 968 5 11 43 13 208 11 l203 -3 5 -946z m1269 301 c277 -57 482 -250 567
                    -535 32 -110 44 -311 24 -433 -41 -261 -186 -468 -404 -577 -125 -62 -196 -79
                    -336 -79 -89 0 -133 5 -195 22 -207 59 -367 192 -465 387 -67 135 -83 213 -84
                    410 -1 149 2 180 22 250 74 256 249 452 467 525 159 53 259 60 404 30z m1699
                    -6 c46 -10 141 -14 348 -14 l285 0 -3 -152 -3 -153 -127 -3 c-71 -1 -128 -5
                    -128 -8 0 -2 7 -15 14 -27 24 -36 46 -136 46 -207 -1 -309 -238 -520 -585
                    -521 -60 0 -124 6 -159 16 -55 14 -60 14 -78 -2 -31 -28 -48 -68 -48 -115 0
                    -53 17 -80 67 -104 33 -16 76 -19 328 -25 219 -5 308 -11 365 -24 199 -46 307
                    -146 329 -305 32 -238 -136 -460 -419 -554 -125 -41 -218 -57 -376 -63 -438
                    -17 -704 134 -705 398 -1 117 69 231 186 304 17 10 32 20 34 22 2 2 -21 29
                    -51 60 -68 72 -92 135 -86 231 5 87 36 151 110 225 32 32 58 61 58 63 0 2 -19
                    21 -42 42 -86 77 -151 211 -164 338 -8 71 16 203 48 272 51 108 146 200 263
                    257 150 72 316 88 493 49z" />
                                    <path d="M2010 4837 c-56 -16 -108 -47 -177 -105 l-53 -44 0 -343 0 -343 33
                    -28 c17 -15 61 -41 97 -58 58 -28 75 -31 155 -31 80 0 95 3 137 27 141 83 205
                    250 195 508 -6 154 -27 239 -80 316 -58 88 -196 133 -307 101z" />
                                    <path d="M4614 4832 c-150 -53 -233 -219 -234 -465 0 -303 124 -487 330 -487
                    207 0 330 179 330 479 0 189 -40 321 -122 403 -78 78 -203 107 -304 70z" />
                                    <path d="M6318 4896 c-99 -27 -163 -113 -174 -237 -17 -179 72 -311 220 -326
                    100 -10 185 37 234 131 24 46 26 62 27 156 0 96 -2 110 -28 158 -33 63 -90
                    107 -158 121 -60 13 -61 13 -121 -3z" />
                                    <path d="M6128 3530 c-34 -26 -78 -115 -78 -157 0 -140 165 -224 409 -210 158
                    9 274 57 331 137 30 42 37 107 16 148 -33 63 -71 72 -371 81 -137 5 -257 11
                    -266 15 -9 4 -26 -2 -41 -14z" />
                                </g>
                            </svg>
                        </a>
                        <a href="" target="_blank">
                            <i class="fab fa-facebook-square footerSnsIcorn"></i>
                        </a>
                    </div>
                </div>

                <div class="terms">
                    <div>전세버스 운송약관</div>
                    <div>서비스 이용약관</div>
                    <div>개인정보 보호정책</div>
                </div>

            </div>

        </footer>
    )
}